/**
 * 升级日志内容
 */

const UpdateLogData = [

  {
    date: '2023-07-05',
    version: 'v1.1.2',
    data: [
      {
        name: '模块功能优化22222222',
        data: [
          '新增数据大屏模块',
          '智能交互模块/调度任务模块/流程管理/表单管理/在线调查功能调整',
          '支持动态数据源，文件服务支持S3协议',
          '消息中心增加对企业微信消息和自定义消息的支持',
          '添加支持租户管理员的功能',
          'gateway加入熔断的功能',
          '修复已知的bug',
        ]
      },
    ]
  },
  {
    date: '2023-03-31',
    version: 'v1.1.1',
    data: [
      {
        name: '模块功能优化',
        data: [
          '新增服务监控/任务调度模块',
          '添加用户密码SM加密功能',
          '授权功能调整',
          '防篡改防重放机制调整',
          '智能交互模块/调度任务模块/流程管理/表单管理/在线调查功能调整',
          '修复已知的bug',
        ]
      },
    ]
  },
  {
    date: '2023-02-10',
    version: 'v1.1.0',
    data: [
      {
        name: '模块功能优化',
        data: [
          '新增调查问卷模块',
          '添加用户密码RSA加密功能',
          '添加授权功能',
          '添加防篡改防重放功能',
          '流程管理/表单管理功能调整',
          '消息中心增加对企业微信消息的支持',
          '修复已知的bug',
        ]
      },
    ]
  },

  {
    date: '2022-04-10',
    version: 'v0.1.1',
    data: [
      {
        name: '新增功能',
        data: [
          '新增角色管理功能，是系统可以通过角色对用户进行分配权限',
          '新增部门管理功能，可以给不同的用户分配不同的部门，一个用户只能使用一个部门',
          '新增日志管理，可以管理查看用户的登录日志以及操作日志，登录日志可以看到用户的登录事件，登录ip、等信息；操作日志可以看到操作的具体参数、允许事件、操作结果、操作人员等信息',
          '新增桌面模式，在桌面模式中我们可以看到系统张的各个模块，一桌面的方式进行展示，类似与我们的windows系统，对我们系统中的所偶的模块进行重新整理展示，桌面的图标可以点击打开相应的模块'
        ]
      },
      {
        name: '模块升级',
        data: [
          '升级用户管理模块，对用户管理模块进行升级，通过用户基本信息管理，系统维护人员可以管理用户的账号、正常还是暂停或待激活等状态、终端序列号、计费帐号、支付方式、在线IP地址等。',
          '升级消息管理模块，通过用户基本信息管理，系统维护人员可以管理用户的账号、正常还是暂停或待激活等状态、终端序列号、计费帐号、支付方式、在线IP地址等。',
          '升级消息模板，通过用户基本信息管理，系统维护人员可以管理用户的账号、正常还是暂停或待激活等状态、终端序列号、计费帐号、支付方式、在线IP地址等。通过用户基本信息管理，系统维护人员可以管理用户的账号、正常还是暂停或待激活等状态、终端序列号、计费帐号、支付方式、在线IP地址等。',
          '升级我的消息，升级了我们的消息，通过用户基本信息管理，系统维护人员可以管理用户的账号、正常还是暂停或待激活等状态、终端序列号、计费帐号、支付方式、在线IP地址等。通过用户基本信息管理，系统维护人员可以管理用户的账号、正常还是暂停或待激活等状态、终端序列号、计费帐号、支付方式、在线IP地址等。'
        ]
      }
    ]
  },



]


// export default { UpdateLog }
